# StructConnectionBeamStart Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructConnectionBeamStart Property
ParameterTypeId Class See Also
---
"Start Connection"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructConnectionBeamStart { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructConnectionBeamStart As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructConnectionBeamStart {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace